_Rarzrabotki/Rarus/USO2/Documents/УПН_РегистрацияПараметровОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УПН_РегистрацияПараметровОбъектовНедвижимости</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УПН_ПараметрыОбъектовНедвижимостиПоБТИ</xr:Item>
				<xr:Item>InformationRegister.УПН_ПлощадиОбъектовНедвижимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ВидыОперацийРегистрацияПараметровОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТехПаспортаБТИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТехПаспортаБТИ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновитьИнформациюОФактическихПлощадяхОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЖилаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЖилыхКомнат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УПН_ПлощадиОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УПН_ПлощадиОбъектовНедвижимости</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЖилыхКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УПН_ВидыОперацийРегистрацияПараметровОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УПН_ВидыОперацийРегистрацияПараметровОбъектовНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзменениеПлощадей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническаяИнвентаризация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/АУН_ОбъектыНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>АУН_ОбъектыНедвижимости</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвартиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ТипыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АУН_КатегорииОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_НазначенияОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринадлежитОбъекту</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УПН_РегистрацияПараметровОбъектовНедвижимости/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область Общее

&НаСервере
Функция ЭтоОперацияИзменениеПлощадей()
	
	Возврат (Объект.ВидОперации = Перечисления.УПН_ВидыОперацийРегистрацияПараметровОбъектовНедвижимости.ИзменениеПлощадей);
	
КонецФункции

&НаКлиенте
Функция ЭтоЧисло(знач ЧислоСтрока)
	
	Если СтрЧислоВхождений(ЧислоСтрока, ".") + СтрЧислоВхождений(ЧислоСтрока, ",") > 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЧислоСтрока = СтрЗаменить(ЧислоСтрока, ",", "");
	ЧислоСтрока = СтрЗаменить(ЧислоСтрока, ".", "");
	
	Результат = Истина;
	Для Сч = 1 По СтрДлина(ЧислоСтрока) Цикл
		Если Найти("0123456789", Сред(ЧислоСтрока, Сч, 1)) = 0 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеПоБТИВСтроке(СтрокаТаб)
	
	Если ТипЗнч(СтрокаТаб) = Тип("Число") Тогда
		СтрокаТЧ = Объект.ПараметрыОбъектов[СтрокаТаб - 1];
	Иначе
		СтрокаТЧ = СтрокаТаб;
	КонецЕсли;
	
	//СтрокаТЧ.ОбщаяПлощадь = 0;
	СтрокаТЧ.ОбщаяПлощадьДоБТИ = 0;
	//СтрокаТЧ.ЖилаяПлощадь = 0;
	//СтрокаТЧ.КоличествоЖилыхКомнат = 0;  
	
	Запрос = Новый Запрос;
	
	Дата = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Объект.Ссылка), Дата - 24*60*60, Дата));
	Запрос.УстановитьПараметр("ОбъектНедвижимости", СтрокаТЧ.ОбъектНедвижимости);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлощадиОбъектовНедвижимости.ОбщаяПлощадь
	|ИЗ
	|	РегистрСведений.УПН_ПлощадиОбъектовНедвижимости.СрезПоследних(&Период, ОбъектНедвижимости = &ОбъектНедвижимости) КАК ПлощадиОбъектовНедвижимости";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		//СтрокаТЧ.ОбщаяПлощадь       = Выборка.ОбщаяПлощадь;
		СтрокаТЧ.ОбщаяПлощадьДоБТИ = Выборка.ОбщаяПлощадь;
		
	КонецЕсли;
	
	СтрокаТЧ.Отклонение = СтрокаТЧ.ОбщаяПлощадь - СтрокаТЧ.ОбщаяПлощадьДоБТИ;		
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоБТИ()
	
	Если Объект.ВидОперации = Перечисления.УПН_ВидыОперацийРегистрацияПараметровОбъектовНедвижимости.ТехническаяИнвентаризация Тогда
		Для Каждого СтрокаТЧ Из Объект.ПараметрыОбъектов Цикл
			ЗаполнитьДанныеПоБТИВСтроке(СтрокаТЧ);
		КонецЦикла;                        	
	КонецЕсли;  	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущимиДаннымиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Здание", Объект.Здание);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыНедвижимости.Ссылка КАК ОбъектНедвижимости,
	|	ПлощадиОбъектовНедвижимости.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	ПлощадиОбъектовНедвижимости.ЖилаяПлощадь КАК ЖилаяПлощадь,
	|	ПлощадиОбъектовНедвижимости.КоличествоЖилыхКомнат КАК КоличествоЖилыхКомнат
	|ИЗ
	|	Справочник.АУН_ОбъектыНедвижимости КАК ОбъектыНедвижимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УПН_ПлощадиОбъектовНедвижимости.СрезПоследних КАК ПлощадиОбъектовНедвижимости
	|		ПО (ПлощадиОбъектовНедвижимости.ОбъектНедвижимости = ОбъектыНедвижимости.Ссылка)
	|ГДЕ
	|	(ОбъектыНедвижимости.ПринадлежитОбъекту = &Здание
	|			ИЛИ ОбъектыНедвижимости.Ссылка = &Здание)
	|	И НЕ ОбъектыНедвижимости.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПлощадиОбъектовНедвижимости.ОбъектНедвижимости";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Объект.ПараметрыОбъектов.Очистить();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество() > 1 И Выборка.ОбъектНедвижимости = Объект.Здание Тогда
			Продолжить;				
		КонецЕсли;
		НоваяСтрока = Объект.ПараметрыОбъектов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		ЗаполнитьДанныеПоБТИВСтроке(НоваяСтрока);
		НоваяСтрока.ОбщаяПлощадь = НоваяСтрока.ОбщаяПлощадьДоБТИ;
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМодифицированностьВФорме(Знач Оповещение)
	
	Результат = Ложь;
	
	Если ЭтаФорма.Модифицированность ИЛИ Не Объект.Проведен Тогда
		
		Если ЭтаФорма.Модифицированность Тогда
			Текст = "Документ изменен. Для формирования доп. соглашения его необходимо записать и провести.
			|Записать и провести?";
		Иначе
			Текст = "Документ не проведен. Для формирования доп. соглашения его необходимо провести.
			|Провести?";
		КонецЕсли;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьМодифицированностьВФормеВопросЗавершение", ЭтотОбъект, Новый Структура("Оповещение, Результат", Оповещение, Результат)), Текст, РежимДиалогаВопрос.ОКОтмена,, КодВозвратаДиалога.Отмена, "Документ изменен");
        Возврат;
		
	Иначе
		Результат = Истина;
	КонецЕсли;
	
	ПроверитьМодифицированностьВФормеФрагмент(Оповещение, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМодифицированностьВФормеВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Оповещение = ДополнительныеПараметры.Оповещение;
    Результат = ДополнительныеПараметры.Результат;
    
    Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
        
        Попытка
            
            Отказ = Не ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
            
        Исключение
            
            ПоказатьПредупреждение(Новый ОписаниеОповещения("ПроверитьМодифицированностьВФормеЗавершение", ЭтотОбъект, Новый Структура("Оповещение, Результат", Оповещение, Результат)), "Операция не выполнена!");
            Возврат;
            
        КонецПопытки;
        
        Если Отказ Тогда
            ВыполнитьОбработкуОповещения(Оповещение, Результат = Истина);
            Возврат;
        КонецЕсли;
        
        Результат = Истина;
        
    КонецЕсли;
    
    ПроверитьМодифицированностьВФормеФрагмент(Оповещение, Результат);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМодифицированностьВФормеФрагмент(Знач Оповещение, Знач Результат)
    
    ВыполнитьОбработкуОповещения(Оповещение, Результат);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМодифицированностьВФормеЗавершение(ДополнительныеПараметры) Экспорт
    
    Оповещение = ДополнительныеПараметры.Оповещение;
    Результат = ДополнительныеПараметры.Результат;
    
    ВыполнитьОбработкуОповещения(Оповещение, Результат = Истина);

КонецПроцедуры

// Процедура устанавливает видимость для тех колонок в табличной части 
// "Товары", видимость которых определяется реквизитами документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура УстановитьВидимостьНаКлиенте()

	ОперацияИзменениеПлощадей = ЭтоОперацияИзменениеПлощадей();
	Элементы.НомерТехПаспортаБТИ.Видимость = Не ОперацияИзменениеПлощадей;
	Элементы.ДатаТехПаспортаБТИ.Видимость = Не ОперацияИзменениеПлощадей;
	Элементы.ОбновитьИнформациюОФактическихПлощадяхОбъектов.Видимость = Не ОперацияИзменениеПлощадей;
	Элементы.ПараметрыОбъектовОбщаяПлощадьДоБТИ.Видимость = Не ОперацияИзменениеПлощадей;
	Элементы.ПараметрыОбъектовОтклонение.Видимость = Не ОперацияИзменениеПлощадей;
	
КонецПроцедуры // УстановитьВидимость()

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	ЗаполнитьДанныеПоБТИ();
	
		// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Установить видимость реквизитов и заголовков колонок.
	УстановитьВидимостьНаКлиенте();
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаполнитьДанныеПоБТИ();
	ОповеститьОЗаписиНового(Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимиДанными(Команда)
	
	Если Объект.ПараметрыОбъектов.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьТекущимиДаннымиЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
        Возврат;
	КонецЕсли;
	
	ЗаполнитьТекущимиДаннымиФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимиДаннымиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    ЗаполнитьТекущимиДаннымиФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимиДаннымиФрагмент()
    
    Перем Отказ;
    
    Отказ = Ложь;
    
    Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
        Отказ = Истина;
        Сообщить("Необходимо заполнить реквизит ""Организация""!", СтатусСообщения.Важное);
    КонецЕсли;
    
    Если Отказ Тогда
        Возврат;
    КонецЕсли;
    
    ЗаполнитьТекущимиДаннымиНаСервере();
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ЗаполнитьДанныеПоБТИ();
	УстановитьВидимостьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОбъектовОбъектНедвижимостиПриИзменении(Элемент)
	
	НомерСтроки = Элементы.ПараметрыОбъектов.ТекущиеДанные.НомерСтроки;
	ЗаполнитьДанныеПоБТИВСтроке(НомерСтроки);
	Элементы.ПараметрыОбъектов.ТекущиеДанные.ОбщаяПлощадь = Элементы.ПараметрыОбъектов.ТекущиеДанные.ОбщаяПлощадьДоБТИ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОбъектовОбщаяПлощадьПриИзменении(Элемент)
	
	//НомерСтроки = Элементы.ПараметрыОбъектов.ТекущиеДанные.НомерСтроки;
	//ЗаполнитьДанныеПоБТИВСтроке(НомерСтроки);
	
	ТекСтрока = Элементы.ПараметрыОбъектов.ТекущиеДанные;
	ТекСтрока.Отклонение = ТекСтрока.ОбщаяПлощадь - ТекСтрока.ОбщаяПлощадьДоБТИ;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюОФактическихПлощадяхОбъектовПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект); 
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
